package control;

public class ForExam {
	
/* for 반복문 : 어떤 작업을 반복적으로 수행되도록 할 때 사용
  반복 횟수를 정확히 특정할 때 주로 사용된다.
  문법이 직관적이라 가독성이 좋다.
  
  기본형태
  		for(start ; stop ; step)
 			 초기값        조건식       증감식
 초기값(한번) -> 조건식 -> 수행 문장들 -> 증감식
 	      -> 조건식 -> 수행 문장들 -> 증감식
 	      -> 조건식 -> 수행 문장들 -> 증감식
 	      -> 조건식 -> 종료 
 	      
 초기값 : 반복문에 사용할 변수를 초기화 처음에 딱 한 번만 실행된다.
 	       보통은 변수를 하나만 사용하지만 2개 이상도 가능하긴 하다.
 	       
 	       for(int i=1, j=0; i<10; i++) {}
 	       
 조건식 : 조건식의 값이 참일 경우 계속 반복 실행하다가 거짓이 되는 경우 반복을 종료한다.
  	       조건식을 잘못 설정할 경우 한번도 실행되지 않는 경우가 발생할 수도 있고 영원히 반복되는 경우가 발생할 수 있다.(무한루프)
  	       
 증감식 : i++, i--; i += 2(i = i + 2)
 
 */

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
